// 巡检任务测试数据

let InspectionOptions = {

    // 无人机飞行路线时间点及坐标集合
    DronePositions: [
        { // 时间点1
            time: '2024-01-22 12:00:00',
            lng: 117.092826,
            lat: 31.823636,
            height: 1.5,
        },
        { // 时间点2
            time: '2024-01-22 12:00:05',
            lng: 117.092826,
            lat: 31.823636,
            height: 40,
        },
        { // 时间点3
            time: '2024-01-22 12:00:15',
            lng: 117.092855,
            lat: 31.823354,
            height: 40,
        },
        { // 时间点4
            time: '2024-01-22 12:00:20',
            lng: 117.092535,
            lat: 31.823306,
            height: 40,
        },
        { // 时间点5
            time: '2024-01-22 12:00:25',
            lng: 117.091713,
            lat: 31.823302,
            height: 40,
        },
        { // 时间点6
            time: '2024-01-22 12:00:30',
            lng: 117.090612,
            lat: 31.823298,
            height: 40,
        },
        { // 时间点7
            time: '2024-01-22 12:00:35',
            lng: 117.090545,
            lat: 31.824475,
            height: 40,
        },
        { // 时间点8
            time: '2024-01-22 12:00:40',
            lng: 117.092826,
            lat: 31.823636,
            height: 28.5,
        },
        { // 时间点9
            time: '2024-01-22 12:00:45',
            lng: 117.092826,
            lat: 31.823636,
            height: 0,
        }
    ]

};